Reports/ЛБ_ОтчетОЗаключенныхДоговорахСВИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтчетОЗаключенныхДоговорахСВИП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_ОтчетОЗаключенныхДоговорахСВИП/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	ДатаНач = Отчет.ДатаНач;
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Если ЗначениеЗаполнено(Отчет.Залогодатель) Тогда
		РезультатЗапроса = Новый ТаблицаЗначений;
		РезультатЗапроса.Колонки.Добавить("Залогодатель");
		
		НоваяСтр = РезультатЗапроса.Добавить();
		НоваяСтр.Залогодатель = Отчет.Залогодатель;
	Иначе
		РезультатЗапроса = ПолучитьСписокЗалогодателей(ДатаКон);
	КонецЕсли;
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключенныеДоговораСВИП";
	
	Макет = Отчет.РеквизитМакет;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если ДатаНач = Дата(1,1,1) Тогда 
	    ПериодОтчета = "на " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	Иначе
		ПериодОтчета = "с " + Формат(ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	КонецЕсли;	

	ОбластьШапка.Параметры.Период = ПериодОтчета; 
	Результат.Вывести(ОбластьШапка); 

	ТЗЗБ = Новый ТаблицаЗначений;
	ТЗЗБ.Колонки.Добавить("ЗБ");
	ТЗЗБ.Колонки.Добавить("Отделение");
	ТЗЗБ.Колонки.Добавить("Ломбард");
	ТЗЗБ.Колонки.Добавить("НомерЗБ");
	ТЗЗБ.Колонки.Добавить("ДатаЗБ");
	ТЗЗБ.Колонки.Добавить("ФИОЗаемщика");
	ТЗЗБ.Колонки.Добавить("Выдано");
	ТЗЗБ.Колонки.Добавить("НомерПриказа");
	ТЗЗБ.Колонки.Добавить("ИдивидуальныеУсловия");
	ТЗЗБ.Колонки.Добавить("Ставка");
	ТЗЗБ.Колонки.Добавить("ОценкаДМ");
	ТЗЗБ.Колонки.Добавить("СогласованныеИндивидуальныеУсловия");
	ТЗЗБ.Колонки.Добавить("Приемщик");
	ТЗЗБ.Колонки.Добавить("СКЗБ");
	ТЗЗБ.Колонки.Добавить("СКПриказа");
	ТЗЗБ.Колонки.Добавить("ТекСтатусЗБ");
	
	Для каждого Стр Из РезультатЗапроса Цикл
		
		ДатаНачалаПоиска = Дата(1,1,1);
		
		ДействующийПриказ = НайтиДействующийПриказ(ДатаНач, ДатаКон, Стр.Залогодатель, Истина);

		Если ДействующийПриказ = Неопределено Тогда
			ДействующийПриказ = НайтиДействующийПриказ(ДатаНач, ДатаКон, Стр.Залогодатель);
			
			Если ДействующийПриказ = Неопределено Тогда
				Продолжить;
			Иначе
				ДатаНачалаПоиска = ?(НачалоДня(ДействующийПриказ[0].ДатаНачалаДействия) > НачалоДня(ДатаНач), ДействующийПриказ[0].ДатаНачалаДействия, ДатаНач);
			КонецЕсли;
		КонецЕсли;

		//СписокЗБ = ПолучитьСписокЗБ(ДатаНач, ДатаКон, Стр.Залогодатель);
		СписокЗБ = ПолучитьСписокЗБ(?(ДатаНачалаПоиска = Дата(1,1,1), ДатаНач, ДатаНачалаПоиска), ДатаКон, Стр.Залогодатель);
		
		Если СписокЗБ <> Неопределено Тогда
			Для каждого СтрСписка Из СписокЗБ Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("ЗБ", СтрСписка.ЗБ);
				
				мНайденых = ТЗЗБ.НайтиСтроки(Отбор);
				
				Если мНайденых.Количество() = 0 Тогда
					
					ПриказыВИП = ПолучитьПриказыНаМоментЗБ(СтрСписка.ЗБ.Дата, Стр.Залогодатель);
					
					НоваяСтр = ТЗЗБ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, СтрСписка);
					ЗаполнитьЗначенияСвойств(НоваяСтр, ПриказыВИП);
					
					НоваяСтр.Отделение = ПолучитьОтделениеЛомбарда(СтрСписка.ДатаЗБ, СтрСписка.Ломбард);
					НоваяСтр.ФИОЗаемщика = Стр.Залогодатель;
					
					НоваяСтр.Ставка = ?(ПриказыВИП.Ставки, СтрСписка.Ставка, "");
					
					Если ТипЗнч(СтрСписка.Приемщик) = Тип("СправочникСсылка.Пользователи") Тогда
						НоваяСтр.Приемщик =  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрСписка.Приемщик.Сотрудник.Наименование);
					Иначе
						НоваяСтр.Приемщик =  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрСписка.Приемщик.Наименование);
					КонецЕсли;
					
					Если ПриказыВИП.Металлы Тогда
						ТекстОценки = "";
						Для каждого СтрТ Из СтрСписка.ЗБ.Товары Цикл
							ТекстОценки = ?(ТекстОценки = "", "", ТекстОценки + Символы.ПС);
							ТекстОценки = ТекстОценки + СтрТ.Проба.Наименование + " - " + СтрТ.Цена + " руб/г";
						КонецЦикла;
						НоваяСтр.ОценкаДМ = ТекстОценки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//Изменил для макета с группировкой
	Результат.НачатьАвтогруппировкуСтрок();
	
	ТЗЗалогодателей = РезультатЗапроса.Скопировать(,"Залогодатель");
	ТЗЗалогодателей.Свернуть("Залогодатель");
	
	Для каждого Стр Из ТЗЗалогодателей Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ФИОЗаемщика", Стр.Залогодатель);
		
		мЗБ = ТЗЗБ.НайтиСтроки(Отбор);
		
		Если мЗБ.Количество() > 0 Тогда
			ОбластьЗалогодатель = Макет.ПолучитьОбласть("СтрокаЗалогодатель");
			ОбластьЗалогодатель.Параметры.Залогодатель = Стр.Залогодатель;
			
			Результат.Вывести(ОбластьЗалогодатель, 1);
			
			//Для каждого СтрЗБ Из ТЗЗБ Цикл
			Для каждого СтрЗБ Из мЗБ Цикл
				//
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрЗБ);
				
				//Изменил для макета с группировкой
				Результат.Вывести(ОбластьСтрока, 2);
				//
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	//Изменил для макета с группировкой
	Результат.ЗакончитьАвтогруппировкуСтрок(); 
	
	Результат.ФиксацияСверху = 4;
	Результат.ПоказатьУровеньГруппировокСтрок(0);
	//
КонецПроцедуры

&НаКлиенте
Процедура Интервал(Команда)
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделениеЛомбарда(Дата, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Отделение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Документ", Расшифровка);
		
		ФормаЗ = ПолучитьФорму("ОбщаяФорма.ЛБ_ЖурналПриказовПоЗалогодателям", ПараметрыФормы,, Новый УникальныйИдентификатор());
		ФормаЗ.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоулучитьКонецПериодаПоПриказу(ДатаНач, ДатаКон, Залогодатель, ПриказУстановки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия,
		|	Период";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказУстановки);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//СтруктураВозврата = Новый Структура("Приказы, Дата");
	МассивПриказы = Новый Массив;
	
	МТип = Новый Массив;
	МТип.Добавить(Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия"));
	
	ОписаниеТиповПриказ = Новый ОписаниеТипов(МТип);
	
	ТЗПриказы = Новый ТаблицаЗначений;
	ТЗПриказы.Колонки.Добавить("Приказ", ОписаниеТиповПриказ);
	
	МассивУдаленияСтрок = Новый Массив;
	
	ТЗСтавки = ПриказУстановки.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;

	Для каждого Стр Из РезультатЗапроса Цикл
		Если УстановленныСтавки Тогда
			Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 Тогда
					
					ТЗСтавки.Очистить();
					МассивУдаленияСтрок.Очистить();
					
					ТЗСтавки = Стр.Регистратор.СтавкиПроцентов.Выгрузить(, "Ставка");
					
					Для каждого СтрТЗ Из ТЗСтавки Цикл
						Если СтрТЗ.Ставка = 0 Тогда
							МассивУдаленияСтрок.Добавить(СтрТЗ);
						КонецЕсли;			
					КонецЦикла;
					
					Если МассивУдаленияСтрок.Количество() > 0 Тогда
						Для каждого СтрМ Из МассивУдаленияСтрок Цикл
							ТЗСтавки.Удалить(СтрМ);
						КонецЦикла;
					КонецЕсли;

					Если ТЗСтавки.Количество() > 0 Тогда
						Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
							УстановленныСтавки = Ложь;
						Иначе	
							УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
						КонецЕсли;
						
						НоваяСтр = ТЗПриказы.Добавить();
						НоваяСтр.Приказ = Стр.Регистратор;
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныМеталлы Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
				Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
					УстановленныМеталлы = Ложь;
				Иначе	
					УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
				КонецЕсли;
				
				НоваяСтр = ТЗПриказы.Добавить();
				НоваяСтр.Приказ = Стр.Регистратор;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныВставки Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
				Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
					УстановленныВставки = Ложь;
				Иначе	
					УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
				КонецЕсли;
				
				НоваяСтр = ТЗПриказы.Добавить();
				НоваяСтр.Приказ = Стр.Регистратор;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ УстановленныСтавки И НЕ УстановленныМеталлы И НЕ УстановленныВставки Тогда
			
			ДатаВозврата = ?(НачалоДня(Стр.ДатаНачалаДействия) > НачалоДня(Стр.Период), Стр.ДатаНачалаДействия, Стр.Период);
			
			Возврат ДатаВозврата;
		КонецЕсли;
	КонецЦикла;
	
	ДатаВозврата = Дата(1,1,1);
	
	Возврат ДатаВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗБ(ДатаНач, ДатаКон, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОбъектыЗалогаОбороты.Ломбард КАК Ломбард,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗБ,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Дата КАК ДатаЗБ,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.СуммаСсуды КАК Выдано,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.СхемаКредитования КАК СКЗБ,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.ПроцентнаяСхема КАК Ставка,
		|	ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.ОтветственныйСотрудник КАК Приемщик,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК ТекСтатусЗБ
		|ИЗ
		|	РегистрНакопления.ЛБ_ОбъектыЗалога.Обороты(&ДатаНач, &ДатаКон, Регистратор, ЗалоговыйБилет.Залогодатель = &Залогодатель) КАК ЛБ_ОбъектыЗалогаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		|		ПО ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
		|ГДЕ
		|	ЛБ_ОбъектыЗалогаОбороты.Регистратор ССЫЛКА Документ.ЛБ_ОперацияПоЗалогу
		|	И ВЫБОР
		|			КОГДА ЛБ_ОбъектыЗалогаОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Залог)
		|				ТОГДА ИСТИНА
		|			КОГДА ЛБ_ОбъектыЗалогаОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И ЛБ_ОбъектыЗалогаОбороты.ЗалоговыйБилет.Дата >= &ДатаНач";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьПриказыНаМоментЗБ(Дата, Залогодатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Ставки
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Металлы
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ Вставки
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|				ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|			ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ставки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ СтавкиСорт
		|ИЗ
		|	Ставки КАК Ставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Ставки.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Металлы.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ МеталыСорт
		|ИЗ
		|	Металлы КАК Металлы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Металлы.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Вставки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВставкиСорт
		|ИЗ
		|	Вставки КАК Вставки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
		|	Вставки.Регистратор.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ СтавкиПерв
		|ИЗ
		|	СтавкиСорт КАК СтавкиСорт
		|ГДЕ
		|	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ СтавкиСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МеталыСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ МеталыПерв
		|ИЗ
		|	МеталыСорт КАК МеталыСорт
		|ГДЕ
		|	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ МеталыСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВставкиСорт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВставкиПерв
		|ИЗ
		|	ВставкиСорт КАК ВставкиСорт
		|ГДЕ
		|	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|	И НЕ ВставкиСорт.Регистратор В
		|				(ВЫБРАТЬ
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
		|				ИЗ
		|					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|				ГДЕ
		|					ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
		|							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
		|						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|					КОНЕЦ
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
		|				СГРУППИРОВАТЬ ПО
		|					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
		|	И ВЫБОР
		|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиПерв.Регистратор КАК Приказ,
		|	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
		|	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
		|	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
		|	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
		|	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
		|	ИСТИНА КАК Ставки,
		|	ЛОЖЬ КАК Металлы,
		|	ЛОЖЬ КАК Вставки
		|ПОМЕСТИТЬ Общая
		|ИЗ
		|	СтавкиПерв КАК СтавкиПерв
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МеталыПерв.Регистратор,
		|	МеталыПерв.Регистратор.НомерПриказа,
		|	МеталыПерв.Регистратор.НомерСистемныйЧисло,
		|	МеталыПерв.Регистратор.Дата,
		|	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
		|	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	МеталыПерв КАК МеталыПерв
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВставкиПерв.Регистратор,
		|	ВставкиПерв.Регистратор.НомерПриказа,
		|	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
		|	ВставкиПерв.Регистратор.Дата,
		|	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
		|	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВставкиПерв КАК ВставкиПерв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Общая.Приказ КАК Приказ,
		|	Общая.НомерПриказа КАК НомерПриказа,
		|	Общая.СистемныйНомер КАК СистемныйНомер,
		|	Общая.ДатаДокумента КАК ДатаДокумента,
		|	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	МАКСИМУМ(Общая.Ставки) КАК Ставки,
		|	МАКСИМУМ(Общая.Металлы) КАК Металлы,
		|	МАКСИМУМ(Общая.Вставки) КАК Вставки
		|ИЗ
		|	Общая КАК Общая
		|
		|СГРУППИРОВАТЬ ПО
		|	Общая.Приказ,
		|	Общая.НомерПриказа,
		|	Общая.ДатаДокумента,
		|	Общая.ДатаНачалаДействия,
		|	Общая.ДатаОкончанияДействия,
		|	Общая.СистемныйНомер";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("НомерПриказа", "");
	СтруктураВозврата.Вставить("ИдивидуальныеУсловия", "");
	СтруктураВозврата.Вставить("СогласованныеИндивидуальныеУсловия", "");
	СтруктураВозврата.Вставить("СКПриказа", "");
	СтруктураВозврата.Вставить("Ставки", Ложь);
	СтруктураВозврата.Вставить("Металлы", Ложь);
	СтруктураВозврата.Вставить("Вставки", Ложь);
	
	ТЗСхем = Новый ТаблицаЗначений;
	ТЗСхем.Колонки.Добавить("СК");
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Для каждого СтРез Из РезультатЗапроса Цикл
			СтруктураВозврата.НомерПриказа = ?(СтруктураВозврата.НомерПриказа = "", "", СтруктураВозврата.НомерПриказа + ", ");
			СтруктураВозврата.НомерПриказа = СтруктураВозврата.НомерПриказа + "№" + СтРез.НомерПриказа + " от " + Формат(СтРез.ДатаДокумента, "ДФ=dd.MM.yyyy");
			
			СтруктураВозврата.ИдивидуальныеУсловия = ?(СтруктураВозврата.ИдивидуальныеУсловия = "", "", СтруктураВозврата.ИдивидуальныеУсловия + ", ");
			СтруктураВозврата.ИдивидуальныеУсловия = СтруктураВозврата.ИдивидуальныеУсловия
			+ ?(СтРез.Ставки, "% ставка", "")
			+ ?(СтРез.Металлы, ?(СтРез.Ставки, ", оценка ДМ", "оценка ДМ"), "")
			+ ?(СтРез.Вставки, ?(СтРез.Ставки ИЛИ СтРез.Металлы, ", ДК", "ДК"), "");

			СтруктураВозврата.СогласованныеИндивидуальныеУсловия = ?(СтруктураВозврата.СогласованныеИндивидуальныеУсловия = "", "", СтруктураВозврата.СогласованныеИндивидуальныеУсловия + ", ");
			СтруктураВозврата.СогласованныеИндивидуальныеУсловия = СтруктураВозврата.СогласованныеИндивидуальныеУсловия + СтРез.Приказ.Комментарий;
			
			СтруктураВозврата.Ставки = ?(СтруктураВозврата.Ставки, СтруктураВозврата.Ставки, СтРез.Ставки);
			СтруктураВозврата.Металлы = ?(СтруктураВозврата.Металлы, СтруктураВозврата.Металлы, СтРез.Металлы);
			СтруктураВозврата.Вставки = ?(СтруктураВозврата.Вставки, СтруктураВозврата.Вставки, СтРез.Вставки);
			
			Для каждого СтрСК Из СтРез.Приказ.СхемыКредитования Цикл
				НоваяСтр = ТЗСхем.Добавить();
				НоваяСтр.СК = СтрСК.СхемаКредитования;
			КонецЦикла;
			
		КонецЦикла;
		
		ТЗСхем.Свернуть("СК");
		
		Для каждого СтрТЗСК Из ТЗСхем Цикл
			СтруктураВозврата.СКПриказа = ?(СтруктураВозврата.СКПриказа = "", "", СтруктураВозврата.СКПриказа + ", ");
			СтруктураВозврата.СКПриказа = СтруктураВозврата.СКПриказа + СтрТЗСК.СК;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗалогодателей(ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель КАК Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель.Наименование КАК ЗалогодательНаименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель.Наименование
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(&ДатаКон, ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗалогодательНаименование";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТЗВозврата = РезультатЗапроса.Скопировать(,"Залогодатель");
	ТЗВозврата.Свернуть("Залогодатель");
	
	Если ТЗВозврата.Количество() > 0 Тогда
		Возврат ТЗВозврата;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиДействующийПриказ(ДатаНач, ДатаКон, Залогодатель, НаНачалоПериода = Ложь)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Ставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА 111 = 111
	               |			ИНАЧЕ 222 = 222
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Металлы
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА 333 = 333
	               |			ИНАЧЕ 444 = 444
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Вставки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(, Залогодатель = &Залогодатель) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |				ТОГДА 555 = 555
	               |			ИНАЧЕ 666 = 666
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Ставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиСорт
	               |ИЗ
	               |	Ставки КАК Ставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Ставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Металлы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыСорт
	               |ИЗ
	               |	Металлы КАК Металлы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Металлы.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Металлы.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Вставки.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиСорт
	               |ИЗ
	               |	Вставки КАК Вставки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Вставки.Регистратор.ДатаНачалаДействияПриказа УБЫВ,
	               |	Вставки.Регистратор.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ СтавкиПерв
	               |ИЗ
	               |	СтавкиСорт КАК СтавкиСорт
	               |ГДЕ
	               |	НЕ СтавкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ СтавкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период, ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА СтавкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеталыСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ МеталыПерв
	               |ИЗ
	               |	МеталыСорт КАК МеталыСорт
	               |ГДЕ
	               |	НЕ МеталыСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ МеталыСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период, ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА МеталыСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВставкиСорт.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВставкиПерв
	               |ИЗ
	               |	ВставкиСорт КАК ВставкиСорт
	               |ГДЕ
	               |	НЕ ВставкиСорт.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |	И НЕ ВставкиСорт.Регистратор В
	               |				(ВЫБРАТЬ
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ КАК ОтменяемыйПриказ
	               |				ИЗ
	               |					РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
	               |				ГДЕ
	               |					ВЫБОР
	               |						КОГДА РАЗНОСТЬДАТ(ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период, ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия, ДЕНЬ) = 0
	               |							ТОГДА ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |						ИНАЧЕ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |					КОНЕЦ
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
	               |					И ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Залогодатель = &Залогодатель
	               |				СГРУППИРОВАТЬ ПО
	               |					ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ОтменяемыйПриказ)
	               |	И ВЫБОР
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			КОГДА ВставкиСорт.Регистратор.ДатаОкончанияДействияПриказа >= &Дата
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиПерв.Регистратор КАК Приказ,
	               |	СтавкиПерв.Регистратор.НомерПриказа КАК НомерПриказа,
	               |	СтавкиПерв.Регистратор.НомерСистемныйЧисло КАК СистемныйНомер,
	               |	СтавкиПерв.Регистратор.Дата КАК ДатаДокумента,
	               |	СтавкиПерв.Регистратор.ДатаНачалаДействияПриказа КАК ДатаНачалаДействия,
	               |	СтавкиПерв.Регистратор.ДатаОкончанияДействияПриказа КАК ДатаОкончанияДействия,
	               |	ИСТИНА КАК Ставки,
	               |	ЛОЖЬ КАК Металлы,
	               |	ЛОЖЬ КАК Вставки
	               |ПОМЕСТИТЬ Общая
	               |ИЗ
	               |	СтавкиПерв КАК СтавкиПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	МеталыПерв.Регистратор,
	               |	МеталыПерв.Регистратор.НомерПриказа,
	               |	МеталыПерв.Регистратор.НомерСистемныйЧисло,
	               |	МеталыПерв.Регистратор.Дата,
	               |	МеталыПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	МеталыПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ИСТИНА,
	               |	ЛОЖЬ
	               |ИЗ
	               |	МеталыПерв КАК МеталыПерв
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВставкиПерв.Регистратор,
	               |	ВставкиПерв.Регистратор.НомерПриказа,
	               |	ВставкиПерв.Регистратор.НомерСистемныйЧисло,
	               |	ВставкиПерв.Регистратор.Дата,
	               |	ВставкиПерв.Регистратор.ДатаНачалаДействияПриказа,
	               |	ВставкиПерв.Регистратор.ДатаОкончанияДействияПриказа,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ИСТИНА
	               |ИЗ
	               |	ВставкиПерв КАК ВставкиПерв
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Общая.Приказ КАК Регистратор,
	               |	Общая.НомерПриказа КАК НомерПриказа,
	               |	Общая.СистемныйНомер КАК СистемныйНомер,
	               |	Общая.ДатаДокумента КАК ДатаДокумента,
	               |	Общая.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	МАКСИМУМ(Общая.Ставки) КАК Ставки,
	               |	МАКСИМУМ(Общая.Металлы) КАК Металлы,
	               |	МАКСИМУМ(Общая.Вставки) КАК Вставки
	               |ИЗ
	               |	Общая КАК Общая
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Общая.Приказ,
	               |	Общая.НомерПриказа,
	               |	Общая.ДатаДокумента,
	               |	Общая.ДатаНачалаДействия,
	               |	Общая.ДатаОкончанияДействия,
	               |	Общая.СистемныйНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаДействия";
	               //|	ДатаДокумента";

	Если НаНачалоПериода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "555 = 555", "ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "666 = 666", "ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период <= &Дата
	               |						ИЛИ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
	               |					ИЛИ ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон");
				   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период <= &Дата
	               |						ИЛИ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "444 = 444", "ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
	               |					ИЛИ ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон");
				   
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "555 = 555", "ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период <= &Дата
	               |						ИЛИ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "666 = 666", "ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
	               |					ИЛИ ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия МЕЖДУ &ДатаНач И &ДатаКон");
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);	
	Запрос.УстановитьПараметр("Дата", ДатаНач);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
